bsp.h:
    #define BSP_CLOCK_RATE  ( MC_FREQUENCY_MULTIPLIER * MC_QUARTZ_CLOCK_FREQ )

start.S:
    ...
    li $30, REGBASE
    li $7, 0x00941432
    sw $7, CR_PLL($30)
    li $7, 0xffffffff
    sw $7, CLK_EN($30)
    li $7, 0x3000fc
    sw $7, CSCON0($30)
    li $7, 0x030d0030
    sw $7, SDRCON($30)
    li $7, 0x00F50222
    sw $7, SDRTMR($30)
    li $7, 0x1
    sw $7, SDRCSR($30)
    nop
    ...

# mdb -u
usb mode
MDB version: 4.70 (17/03/2014)
* [1] serial number: 008 2017-05
mdb> reset
Device: idcode=0x40777001
OSCR:    0x200
PCfetch: 0xbfc00000
PCdec:   0
PCexec:  0
PCmem:   0
IRdec:   0
mdb> bp 0 0x800107dc
mdb> run
OSCR:    0x4240 Debug mode triggered by watchpoint 0.

PCfetch: 0x800107e0
PCdec:   0x800107dc
PCexec:  0x80012704
PCmem:   0x80012700
IRdec:   0x27bdfff0
mdb> show a0
a0: 0x3000
mdb> show a1
a1: 0x3
mdb> show a2
a2: 0
mdb> run
OSCR:    0x4240 Debug mode triggered by watchpoint 0.

PCfetch: 0x800107e0
PCdec:   0x800107dc
PCexec:  0x800136d8
PCmem:   0x800136d4
IRdec:   0x27bdfff0
mdb> show a0
a0: 0x3000
mdb> show a1
a1: 0x1
mdb> show a2
a2: 0
mdb> run
OSCR:    0x4240 Debug mode triggered by watchpoint 0.

PCfetch: 0x800107e0
PCdec:   0x800107dc
PCexec:  0x80012754
PCmem:   0x80012750
IRdec:   0x27bdfff0
mdb> show a1
a1: 0x3
mdb> show a2
a2: 0x80
mdb> run
OSCR:    0x4240 Debug mode triggered by watchpoint 0.

PCfetch: 0x800107e0
PCdec:   0x800107dc
PCexec:  0x80012778
PCmem:   0x80012774
IRdec:   0x27bdfff0
mdb> show a1
a1: 0
mdb> show a2
a2: 0x87
mdb> exit 
